{
  "cs230": {
    "description": "An introduction to techniques and building blocks for organizing large programs. Topics include: modules, abstract data types, recursion, algorithmic efficiency, and the use and implementation of standard data structures and algorithms, such as lists, trees, graphs, stacks, queues, priority queues, tables, sorting, and searching. Students become familiar with these concepts through weekly programming assignments using the Java programming language. Students are required to attend an additional two-hour laboratory section each week.Students should submit form bit.ly/CS230F20 in order to get permission.",
    "semester": "202009",
    "details": "CRN: 18024; Credit Hours: 1; Current Enrollment: 0; Seats Available: 25; Max Enrollment: 25;",
    "meeting_info": "Meeting Time(s): MTRF - 11:30 AM - 12:45 PM Loc: Pendleton East 239 Amphitheater Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "Linked Courses: CS 230 - T1-L01-Remote; CS 230 - T1-L02-Remote; CS 230 - T1-L03-Remote; CS 230 - T2-L04-Remote; CS 230 - T2-L05-Remote;",
    "prereqs": "Prerequisites(s): CS 111 and permission of the instructor.",
    "extra_info": []
  },
  "cs304": {
    "description": "A study of the three-layer architecture commonly used for Web-based applications such as e-commerce sites. We will learn to model and design databases using entity-relationship diagrams and the Standard Query Language (SQL) for managing databases. We will focus on Flask, a popular Python-based web micro-framework, as well as important alternatives such as Node.js. We will learn about implementing features using Ajax. We will also discuss performance, reliability, and security issues. Finally, we will create dynamic websites driven by database entries.",
    "semester": "202009",
    "details": "CRN: 17046; Credit Hours: 1; Current Enrollment: 0; Seats Available: 24; Max Enrollment: 24;",
    "meeting_info": "Meeting Time(s): MTWR - 9:30 PM - 10:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "cs251": {
    "description": "This course introduces the principles underlying the design, semantics, and implementation of modern programming languages in major paradigms including function-oriented, imperative, and object-oriented. The course examines: language dimensions including syntax, naming, state, data, control, types, abstraction, modularity, and extensibility; issues in the runtime representation and implementation of programming languages; and the expression and management of parallelism and concurrency. Students explore course topics via programming exercises in several languages, including the development of programming language interpreters.",
    "semester": "202009",
    "details": "CRN: 17271; Credit Hours: 1; Current Enrollment: 0; Seats Available: 24; Max Enrollment: 24;",
    "meeting_info": "Meeting Time(s): MTWRF - 1:00 PM - 2:15 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "cs220": {
    "description": "Human-Computer Interaction is one of the areas that have transformed the way we use computers in the last 30 years. Topics include methodology for designing and testing user interfaces, interaction styles (command line, menus, graphical user interfaces, virtual reality, tangible user interfaces), interaction techniques (including use of voice, gesture, eye movements), design guidelines, and user interface software tools. Students will design a user interface, program a prototype, and test the results for usability.",
    "semester": "202009",
    "details": "CRN: 17042; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 1:00 PM - 3:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): One of the following courses - CS 111, CS 112, CS/MAS 115.",
    "extra_info": []
  },
  "cs320": {
    "description": "Tangible user interfaces emerge as a novel human-computer interaction style that interlinks the physical and digital worlds. Extending beyond the limitations of the computer mouse, keyboard, and monitor, tangible user interfaces allow users to take advantage of their natural spatial skills while supporting collaborative work. Students will be introduced to conceptual frameworks, the latest research, and a variety of techniques for designing and building these interfaces. Developing tangible interfaces requires creativity as well as an interdisciplinary perspective. Hence, students will work in teams to design, prototype, and physically build tangible user interfaces.",
    "semester": "202009",
    "details": "CRN: 17272; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 1:00 PM - 3:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s):  CS 215, CS 220, or CS 230, or permission of the instructor.",
    "extra_info": []
  },
  "cs342": {
    "description": "An introduction to computer security and privacy. Topics will include privacy, threat modeling, software security, web tracking, web security, usable security, the design of secure and privacy preserving tools, authentication, anonymity, practical and theoretical aspects of cryptography, secure protocols, network security, social engineering, the relationship of the law to security and privacy, and the ethics of hacking. This course will emphasize hands-on experience with technical topics and the ability to communicate security and privacy topics to lay and expert audiences. Assignments will include technical exercises exploring security exploits and tools in a Linux environment; problem sets including exercises and proofs related to theoretical aspects of computer security; and opportunities to research, write, present, and lead discussions on security- and privacy-related topics. Students are required to attend an additional 70-minute discussion section each week.",
    "semester": "202009",
    "details": "CRN: 17274; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): TF - 10:00 AM - 12:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 and CS 240 or permission of the instructor.",
    "extra_info": []
  },
  "cs235": {
    "description": "This course offers an introduction to the theory of computation. Topics include languages, regular expressions, finite automata, grammars, pushdown automata, and Turing machines. The first part of the course covers the Chomsky hierarchy of languages and their associated computational models. The second part of the course focuses on decidability issues and unsolvable problems. The final part of the course investigates complexity theory.",
    "semester": "202009",
    "details": "CRN: 17043; Credit Hours: 1; Current Enrollment: 0; Seats Available: 24; Max Enrollment: 24;",
    "meeting_info": "Meeting Time(s): MTWRF - 1:00 PM - 2:15 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 and either MATH 225 or permission of the instructor.",
    "extra_info": []
  },
  "cs240": {
    "description": "This course examines how computers run programs, introducing key software and hardware abstractions and implementations between programming languages and transistors. The course traces representation and translation of data and programs through three broad topics in computer systems: computer hardware implementation, including digital logic, computer arithmetic, and machine organization; the hardware-software interface, including instruction set architecture, assembly code, and the C programming language; and abstractions for practical systems, including the physical memory hierarchy, the operating system process model, virtual memory, and memory management. Students complete extensive hands-on projects in hardware and software systems. Students are required to attend one three-hour laboratory weekly.",
    "semester": "202009",
    "details": "CRN: 17044; Credit Hours: 1.25; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MTWR - 7:00 PM - 8:15 PM",
    "distributions": "Distributions: LAB - Natural and Physical Sciences Laboratory; MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "Linked Courses: CS 240 - T1-L01; CS 240 - T1-L02; CS 240 - T1-L03;",
    "prereqs": "Prerequisites(s): CS 230, or permission of the instructor.",
    "extra_info": []
  },
  "cs242": {
    "description": "A systems-oriented approach to data networks, including a theoretical discussion of common networking problems and an examination of modern networks and protocols. Topics include point-to-point links, packet switching, Internet protocols, end-to-end protocols, congestion control, and security. Projects may include client-server applications and network measurement tools.",
    "semester": "202009",
    "details": "CRN: 17045; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 10:00 AM - 12:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "cs111": {
    "description": "An introduction to problem solving through computer programming. Students learn how to read, modify, design, debug, and test algorithms that solve problems. Programming concepts include control structures, data structures, abstraction, recursion, modularity, and object-oriented design. Students explore these concepts in the context of interactive programs involving graphics and user interfaces using the Python programming language. Students are required to attend an additional two-hour laboratory section each week. Required for students who wish to major or minor in computer science or elect more advanced courses in the field.",
    "semester": "202009",
    "details": "CRN: 18023; Credit Hours: 1; Current Enrollment: 0; Seats Available: 24; Max Enrollment: 24;",
    "meeting_info": "Meeting Time(s): MWRF - 4:00 PM - 5:15 PM Loc: Gray Lot Modular M101S Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "Linked Courses: CS 111 - T1-L01; CS 111 - T1-L02; CS 111 - T1-L03-Remote; CS 111 - T1-L04-Remote; CS 111 - T2-L03; CS 111 - T2-L04; CS 111 - T2-L05; CS 111 - T2-L06;",
    "prereqs": "Prerequisites(s): Fulfillment of the basic skills component of the Quantitative Reasoning requirement. No prior background with computers is expected.",
    "extra_info": []
  },
  "cs121": {
    "description": "Video games are a popular form of interactive media that engage players in dynamic experiences through unprecedented combinations of storytelling, visualization, interactivity, and multi-sensory immersion. This course will introduce students to video game production and concepts. We will develop a framework for critically analyzing this medium, learn to identify effective strategies for creating games and describe what elements of design impact the final experience of a game. We’ll also identify the function of user agency in this medium to better understand how players are affected by representation in video games. Throughout the course, students will be asked to apply these concepts while building their own games and become familiar with the fundamentals of video game design.",
    "semester": "202009",
    "details": "CRN: 18244; Credit Hours: 1; Current Enrollment: 0; Seats Available: 16; Max Enrollment: 16;",
    "meeting_info": "Meeting Time(s): TF - 10:00 AM - 12:45 PM Loc: Gray Lot Modular M209S Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): None. Open to Firstyears and Sophomores, others by permission of the instructor.",
    "extra_info": [
      "Crosslisted courses:  MAS 121 T1-01 - Intro to Game Design"
    ]
  },
  "cs231": {
    "description": "An introduction to the design and analysis of fundamental algorithms. General techniques covered: divide-and-conquer algorithms, dynamic programming, greediness, probabilistic algorithms. Topics include: sorting, searching, graph algorithms, compression, cryptography, computational geometry, and NP-completeness.",
    "semester": "202009",
    "details": "CRN: 17269; Credit Hours: 1; Current Enrollment: 0; Seats Available: 24; Max Enrollment: 24;",
    "meeting_info": "Meeting Time(s): MTRF - 11:30 AM - 12:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s):  CS 230 and either MATH 225 or permission of the instructor.",
    "extra_info": []
  },
  "math206": {
    "description": "Linear algebra is one of the most beautiful subjects in the undergraduate mathematics curriculum. It is also one of the most important with many possible applications. In this course, students learn computational techniques that have widespread applications in the natural and social sciences as well as in industry, finance, and management. There is also a focus on learning how to understand and write mathematical proofs and an emphasis on improving mathematical style and sophistication. Topics include vector spaces, subspaces, linear independence, bases, dimension, inner products, linear transformations, matrix representations, range and null spaces, inverses, and eigenvalues.",
    "semester": "202009",
    "details": "CRN: 17099; Credit Hours: 1; Current Enrollment: 0; Seats Available: 25; Max Enrollment: 25;",
    "meeting_info": "Meeting Time(s): MTWRF - 4:00 PM - 5:15 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): MATH 205 or MATH 215; or, with permission of the instructor, MATH 116, MATH 120, or the equivalent. At most two of the three courses MATH 206, MATH 210, and MATH 215 can be counted toward the major or minor.",
    "extra_info": []
  },
  "cs341": {
    "description": "This course is designed to provide a solid foundation in the design and implementation of key concepts in existing operating systems. These concepts include process management, scheduling, multitasking, synchronization, deadlocks, memory management, file systems, and I/O operations. Throughout the course, the mechanism design aspects of these concepts will be discussed and assessed from the point of view of a programmer. Moreover, more modern operating systems will be explored, such as virtual operating systems.",
    "semester": "202009",
    "details": "CRN: 17273; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MTWR - 8:15 PM - 9:30 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 240 or permission of instructor.",
    "extra_info": []
  },
  "math220": {
    "description": "Probability is the mathematics of uncertainty.  We begin by developing the basic tools of probability theory, including counting techniques, conditional probability, and Bayes's Theorem.  We then survey several of the most common discrete and continuous probability distributions (binomial, Poisson, uniform, normal, and exponential, among others) and discuss mathematical modeling using these distributions. Often we cannot calculate probabilities exactly, and we need to approximate them.  A powerful tool here is the Central Limit Theorem, which provides the link between probability and statistics.  Another strategy when exact results are unavailable is simulation.  We examine Markov chain Monte Carlo methods, which offer a means of simulating from complicated distributions.",
    "semester": "202009",
    "details": "CRN: 18061; Credit Hours: 1; Current Enrollment: 0; Seats Available: 10; Max Enrollment: 10;",
    "meeting_info": "Meeting Time(s): MTRF - 1:00 PM - 2:15 PM Loc: Science Center E Wing 319 Active Learning Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): MATH 205",
    "extra_info": [
      "Crosslisted courses:  STAT 220 T1-01 - Probability"
    ]
  },
  "cs332": {
    "description": "This course explores methods for deriving information about the three-dimensional world from visual images and using this information for tasks such as recognizing objects and events, navigating through a dynamic scene, and communicating between social agents. We use an interdisciplinary approach that combines computer science, psychology, and neuroscience, facilitating the design of effective computer vision systems while contributing to an understanding of human visual processing and how it is carried out in the brain. Topics include edge detection, stereo vision, motion analysis, the analysis of color, object and face recognition, activity recognition, visual attention and search, recognition methods based on deep learning, and applications in medicine, security, information retrieval, and mobile robotics. The course uses vision software written in MATLAB.",
    "semester": "202009",
    "details": "CRN: 17048; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 10:00 AM - 12:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 112 or CS 230, or permission of the instructor.",
    "extra_info": []
  },
  "cs204": {
    "description": "This course introduces modern web development using HTML, CSS and JavaScript. JavaScript is explored in detail, including scoping, closures, objects, prototype inheritance, and namespacing. The jQuery library is also introduced, and the course covers event handling and Ajax interactions. Students will build web pages using front-end templates such as bootstrap and JavaScript libraries for client-side templating. Designed web pages will be modern, responsive and accessible. The course also covers the jQuery UI (User Interface) library and its capabilities.",
    "semester": "202009",
    "details": "CRN: 18145; Credit Hours: 1; Current Enrollment: 0; Seats Available: 14; Max Enrollment: 14;",
    "meeting_info": "Meeting Time(s): MTRF - 8:30 AM - 9:45 AM Loc: Margaret Clapp Library 131 - Computer Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 111 or permission of the instructor.",
    "extra_info": []
  },
  "cs315": {
    "description": "In the past decade, we have experienced the rise of socio-technical systems used by millions of people: Google, Facebook, Twitter, Wikipedia, etc. Such systems are on the one hand computational systems, using sophisticated infrastructure and algorithms to organize huge amount of data and text, but on the other hand social systems, because they cannot succeed without human participation. How are such systems built? What algorithms underlie their foundations? How does human behavior influence their operation and vice-versa? In this class, we will delve into answering these questions by means of: a) reading current research papers on the inner-workings of such systems; b) implementing algorithms that accomplish tasks such as web crawling, web search, random walks, learning to rank, text classification, topic modeling; and c) critically thinking about the unexamined embrace of techno-solutionism using a humanistic lens.To pre-register for CS 315, please visit this link http://bit.ly/cs315fa20 to fill out the form. You'll be notified before registration starts.",
    "semester": "202009",
    "details": "CRN: 17047; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MTRF - 2:30 PM - 3:45 PM",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "cs115": {
    "description": "Technologies and services made available from Computer Science, such as online environments Facebook, Twitter, and Wikipedia, are integral in today's world. Many problems exist in our real world that transfer to and get amplified in the virtual world created by highly interconnected and ubiquitous computing. What are the basic technologies that enable all this innovation? How do these new environments affect our lives? This course aims to answer these questions through investigation of the socio-techno web. On the technical side we study three languages: HTML5, CSS, and basic JavaScript. We interweave the technical with the social aspects by examining issues introduced by the use of the Social Web. In the process we learn how computers work.",
    "semester": "202009",
    "details": "CRN: 18242; Credit Hours: 1; Current Enrollment: 0; Seats Available: 27; Max Enrollment: 27;",
    "meeting_info": "Meeting Time(s): MTRF - 8:30 AM - 9:45 AM Loc: Alumnae Hall Ballroom West",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s):  This course is open to Firstyears and Sophomores, others by permission.",
    "extra_info": [
      "Crosslisted courses:  MAS 115 T1-01 - Computing for the Socio-Techno Web"
    ]
  },
  "cs234": {
    "description": "As the number of our digital traces continues to grow, so does the opportunity for discovering meaningful patterns in these traces. In this course, students will initially learn how to collect, clean, format, and store data from digital platforms. By adopting a computational approach to statistical analysis, students will then implement in code different statistical metrics and simulation scenarios for hypothesis testing and estimation. Finally, students will generate meaningful visualizations for data exploration and communicating results. Additionally, we will discuss the ethics of data collection and think critically about current practices of experimenting with online users. Students will work in groups to create their own datasets, ask an interesting question, perform statistical analyses and visualizations, and report the results.To pre-register for CS 234, please visit this link http://bit.ly/cs234fa20 to fill out the form. You'll be notified before registration starts.",
    "semester": "202009",
    "details": "CRN: 17270; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 1:00 PM - 3:45 PM",
    "distributions": "Distributions: QRF - Quantitative Reasoning - Overlay; MM - Mathematical Modeling and Problem Solving; QRDL - Quantitative Reasoning - Data Literacy",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "math225": {
    "description": "Combinatorics is the art of counting possibilities: for instance, how many different ways are there to distribute 20 apples to 10 kids? Graph theory is the study of connected networks of objects. Both have important applications to many areas of mathematics and computer science. The course will be taught emphasizing creative problem-solving as well as methods of proof, such as proof by contradiction and induction. Topics include: selections and arrangements, generating functions, recurrence relations, graph coloring, Hamiltonian and Eulerian circuits, and trees.",
    "semester": "202009",
    "details": "CRN: 18179; Credit Hours: 1; Current Enrollment: 0; Seats Available: 18; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MTWRF - 1:00 PM - 2:15 PM Loc: Science Center L Wing  043 Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): MATH 116, MATH 120, or the equivalent; or CS 230 together with permission of the instructor.",
    "extra_info": []
  },
  "cs301": {
    "description": "This course covers principles and practice in the design and implementation of modern compilers and programming language runtime systems. Topics include lexical analysis, parsing, symbols tables, semantic analysis, type checking, intermediate representations, program analysis and optimization, code generation, garbage collection, and other runtime support. As time permits, the course may also survey topics including just-in-time compilation, runtime optimization, concurrent runtime systems, or extended automatic program error detection. Students will construct a full compiler and runtime system for a simple statically-typed programming language over the course of the semester.",
    "semester": "202102",
    "details": "CRN: 21167; Credit Hours: 1; Current Enrollment: 0; Seats Available: UNL; Max Enrollment: UNL;",
    "meeting_info": "Meeting Time(s):  -",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 and at least one of CS 240 or CS 251. CS 235 is recommended, but not required.",
    "extra_info": []
  },
  "cs232": {
    "description": "What is artificial intelligence (AI) and should humans fear it as one of \"our biggest existential threats\"? In this course we will grapple with these difficult questions and investigate them in different ways. We will follow the history of AI from Alan Turing's \"Can Machines Think?\" seminal paper to the recent Elon Musk musings on AI's threat to mankind. We will discuss the underlying theory of the symbolic, knowledge-rich approaches of the 20th century AI (e.g., rule-based systems) and the 21st century approaches relying on statistical learning from large amounts of data (e.g., machine learning algorithms). Finally, we will dissect some of the AI applications in modern life: personal assistant technology like Alexa and Siri, machine translation (Google Translate), and self-autonomous cars. By the end of the semester, students should be able to answer the starting questions in depth and with nuance.",
    "semester": "202102",
    "details": "CRN: 21152; Credit Hours: 1; Current Enrollment: 0; Seats Available: UNL; Max Enrollment: UNL;",
    "meeting_info": "Meeting Time(s):  -",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "cs307": {
    "description": "A survey of topics in computer graphics with an emphasis on fundamental techniques. Topics include: graphics hardware, fundamentals of three-dimensional graphics including modeling, projection, coordinate transformation, synthetic camera specification, color, lighting, shading, hidden surface removal, animation, and texture-mapping. We also cover the mathematical representation and programming specification of lines, planes, curves, and surfaces. Students will build graphics applications using a browser-based platform.",
    "semester": "202102",
    "details": "CRN: 21028; Credit Hours: 1; Current Enrollment: 0; Seats Available: UNL; Max Enrollment: UNL;",
    "meeting_info": "Meeting Time(s):  -",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": []
  },
  "cs203": {
    "description": "This course explores how computer code can be used to produce music by examining topics such as digital signal processing, synthesis, protocols, networking, and modeling. Students work with a computer environment called SuperCollider, an open-source software designed for real-time audio synthesis. Students complete weekly programming assignments and create music ranging from synthesizer tracks in popular songs to experimental algorithmic compositions.",
    "semester": "202102",
    "details": "CRN: 21165; Credit Hours: 1; Current Enrollment: 0; Seats Available: UNL; Max Enrollment: UNL;",
    "meeting_info": "Meeting Time(s):  -",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving; ARS - Visual Arts, Music, Theater, Film and Video",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS111",
    "extra_info": []
  },
  "cs321": {
    "description": "Mixed and Augmented Reality technologies combine virtual content with the physical environment, allowing people to interact with computers and digital content in exciting new ways. These emerging human-computer interaction paradigms have been applied to a variety of fields including medicine, education, design, entertainment, and play. This course introduces fundamental methods, principles, and tools for designing, programming, and testing mixed and augmented reality applications. Topics include the history of virtual and augmented reality, application domains, hardware for 3D input and display, tracking and registration, 3D perception, and societal implications. Students will work individually and in teams to develop novel virtual and augmented reality experiences.",
    "semester": "202102",
    "details": "CRN: 21168; Credit Hours: 1; Current Enrollment: 0; Seats Available: UNL; Max Enrollment: UNL;",
    "meeting_info": "Meeting Time(s):  -",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 220 or CS 230.",
    "extra_info": []
  },
  "cs305": {
    "description": "Machine learning is the science of teaching computers how to learn from observations. It is ubiquitous in our interactions with society, showing up in face recognition, web search, targeted advertising, speech processing, genetic analysis, and even Facebook's selection of posts to display. It is currently at the forefront of research in artificial intelligence, and has been making rapid strides given the vast availability of data today. This course is a broad introduction to the field, covering the theoretical ideas behind widely used algorithms like support vector machines, neural networks, graphical models, decision trees, and many more. We will also study practical applications of these algorithms to problems in vision, speech, language, biology, and the social sciences.",
    "semester": "202002",
    "details": "CRN: 27546; Credit Hours: 1; Current Enrollment: 18; Seats Available: 0; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 11:20 AM - 12:35 PM Loc: Science Center L Wing 140 Computer Science Computer Lab CS-3",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving; EC - Epistemology and Cognition",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 and either MATH 206 or MATH 220 or MATH 225.",
    "extra_info": []
  },
  "cs112": {
    "description": "An introduction to computer programming that provides the tools necessary for students to use computers effectively in scientific work, including physical sciences, biological sciences, medicine, mathematics, psychology, and economics. Students learn to write software to solve problems, visualize and analyze data, perform computer simulations, and implement and test computational models that arise in a wide range of scientific disciplines. The course introduces MATLAB, an extensive and widely used technical computing environment with advanced graphics, visualization, and analysis tools, and a rich high-level programming language. Students are required to attend an additional two-hour laboratory section each week.",
    "semester": "202002",
    "details": "CRN: 27210; Credit Hours: 1; Current Enrollment: 15; Seats Available: 15; Max Enrollment: 30;",
    "meeting_info": "Meeting Time(s): MR - 8:30 AM - 9:45 AM Loc: Science Center L Wing 180 Computer Science Computer Lab CS-2",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "Linked Courses: CS 112 - L01; CS 112 - L02;",
    "prereqs": "Prerequisites(s): Fulfillment of the basic skills component of the Quantitative Reasoning requirement. No prior background with computers is expected.",
    "extra_info": []
  },
  "cs343": {
    "description": "What is the “cloud”? What is a distributed system? This course is for students interested in understanding the fundamental concepts and algorithms underlying existing distributed systems. By the end of this course, students will have the basic knowledge needed to work with and build distributed systems, such as peer-to-peer systems and cloud computing systems. Topics include MapReduce, Spark, communication models, synchronization, distributed file systems, coordination algorithms, consensus algorithms, fault-tolerance, and security.",
    "semester": "202002",
    "details": "CRN: 27064; Credit Hours: 1; Current Enrollment: 15; Seats Available: 3; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): TF - 12:45 PM - 2:00 PM Loc: Science Center E Wing 111 Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 (required); CS 231 and CS 242 (recommended).",
    "extra_info": []
  },
  "cs313": {
    "description": "Many elegant computational problems arise naturally in the modern study of molecular biology. This course is an introduction to the design, implementation, and analysis of algorithms with applications in genomics. Topics include bioinformatic algorithms for dynamic programming, tree-building, clustering, hidden Markov models, expectation maximization, Gibbs sampling, and stochastic context-free grammars. Topics will be studied in the context of analyzing DNA sequences and other sources of biological data. Applications include sequence alignment, gene-finding, structure prediction, motif and pattern searches, and phylogenetic inference. Course projects will involve significant computer programming in Java. No biology background is expected.",
    "semester": "201909",
    "details": "Credit Hours: 1; Current Enrollment: 17; Seats Available: 1; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 9:55 AM - 11:10 AM Loc: Science Center L Wing 180 Computer Science Computer Lab CS-2",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 230 or permission of the instructor.",
    "extra_info": [
      "Workday Title: CS 313-01 - Computational Biology",
      "Prerequisite rule enforced at registration: \nWaitlist active - add your name to waitlist (will appear as Waitlist: Permission of Instructor Required in Workday)",
      ""
    ],
    "notes": "Notes: Normally offered in alternate years."
  },
  "cs323": {
    "description": "Social Computing systems connect us to our closest friends, and globally to people all over the world. In recent decades, companies like Facebook, Snapchat, and even Amazon, have reshaped our social environments. All of these systems, at their core, are designed to facilitate interactions between people. What design decisions shape these systems? Students will learn the theoretical foundations of Social Computing drawn from the Social Sciences, and will learn software prototyping and design techniques to create new systems. This class will explore topics such as identity, anonymity, reputation, moderation, crowdsourcing, and social algorithms. Students will work in teams to design, prototype, and build social computing systems.",
    "semester": "201909",
    "details": "Credit Hours: 1; Current Enrollment: 19; Seats Available: 0; Max Enrollment: 18;",
    "meeting_info": "Meeting Time(s): MR - 2:20 PM - 3:35 PM Loc: Science Center L Wing  043 Classroom",
    "distributions": "Distributions: MM - Mathematical Modeling and Problem Solving",
    "linked_courses": "",
    "prereqs": "Prerequisites(s): CS 220 or CS230.",
    "extra_info": [
      "Workday Title: CS 323-01 - Social Computing",
      "Prerequisite rule enforced at registration: \nWaitlist active - add your name to waitlist (will appear as Waitlist: Permission of Instructor Required in Workday)",
      ""
    ],
    "notes": "Notes:"
  }
}